#include "pch.h"
#include "iostream"

using namespace std;

/*Ќапишите программу, котора€ выводит меню бизнес-ланча ресторана в зависимости от дн€ недели.
¬ меню есть обща€ часть, а есть уникальна€, котора€ зависит от дн€ недели.
ѕользователь должен ввести номер дн€ недели Ч от 1 (понедельник) до 7 (воскресенье), а программа должна вывести на экран день недели и меню этого дн€.*/

void task7() {
	cout << "задача реализована как меню навигации по задачам";

	cout << "–абота выполнена в visual studio, т.к. replit неудобен, а так хоть поразбиратьс€ приходитьс€";
}